# ApparentPower Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ApparentPower Property
SpecTypeId Class See Also
---
Apparent Power, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ApparentPower { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ApparentPower As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ApparentPower {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace